Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/dealing_with_debt.html.txt.tmx
Source language: en
Languages: ga

source: Overview of problem debt
ga: Forbhreathnú ar fhiachas fadhbach

source: • Getting help from MABS
ga: • Cabhair a fháil ó MABS

source: • What you can do yourself
ga: • Conas fiacha a láimhseáil tú féin

source: Any form of credit is a debt, so most people have some debts
ga: Is fiacha atá i chuile chinéal creidmhis. Mar sin, tá fiacha ag beagnach gach duine

source: It is only when you are unable to keep up with the payments that your debt becomes a problem
ga: Ní bhíonn fadhb ann ach nuair nach bhfuil tú ábalta coinneáil suas le do chuid íocaíochtaí

source: If you are in this situation, for whatever reason, you may find yourself having some of the following difficulties:
ga: Má tá tú sa staid seo, d'fhéadfadh na deacrachtaí seo leanas a bheith i gceist:

source: • Missed payments and letters from creditors
ga: • Bheith ar gcúl le hiocaíochtaí agus litreacha ag teacht ó chreidiúnaithe

source: • Borrowing money to pay bills and catch up with arrears
ga: • Ag fáil íasachtaí chun billí a íoc agus breith suas ar íocaíochtaí

source: • Paying whichever creditor is putting on most pressure
ga: • Ag íoc cibé creidiúnaí atá ag cur an méid is mó brú ort

source: • Making promises to pay unreasonable amounts
ga: • Ag déanamh geallúintí méideanna mí-réasúnta a íoc

source: • Broken promises and more pressure from creditors
ga: • Geallúintí briste agus tuilleadh brú ó chreidiúnaithe

source: It is vital to take action to deal with your debts and stop the situation from getting any worse
ga: Tá sé an-tábhachtach déileáil le d’fhiachais ionas nach n-éireoidh an staid níos measa

source: For example, if you don’t start getting your debts under control, your creditors could go to court and eventually repossess your home
ga: Mar shampla, mura ndéileálann tú le d’fhiachais, d’fhéadfaí do theach a athshealbhú

source: This can happen even if you have no mortgage on your home or your mortgage payments are up to date
ga: Is féidir go dtarlódh sé seo fiú muna bhfuil morgáiste nó riaráistí morgáiste agat

source: Getting help from MABS
ga: Cabhair a fháil ó MABS

source: The Money Advice and Budgeting Service (MABS) is a free and confidential service for people with debt problems and money management problems
ga: Is seirbhís rúnda agus saor in aisce í an tSeirbhís Bhuiséadta agus Chomhairle Airgid (MABS) do dhaoine a bhfuil fadhbanna acu maidir le fiachas agus airgead a bhainistiú

source: MABS can help you to explore your options and deal with your debt in a systematic way
ga: Is féidir le MABS cabhrú leat do roghanna a scrúdú agus déileáil le d’fhiachais go córasach

source: Its website mabs.ie has several useful resources, including a self-help guide – see ‘What you can do yourself’ below
ga: Tá acmhainní úsáideacha ar a láithreán gréasáin mabs.ie, ina measc treoir féin-chabhrach - féach 'Cad is féidir a dhéanamh tú féin' thíos

source: Dealing with creditors: MABS has agreed a protocol (pdf) with the Banking and Payments Federation of Ireland (BPFI) to help people to manage their debt repayments in a way that they can afford
ga: Deileáil le do chreidiúnaithe: D'fhorbair MABS agus Cónaidhm Bhaincéireachta agus Íocaíochtaí na hÉireann (BPFI) prótacal (pdf) chun cabhrú le daoine atá i bhfiacha a n-aisíocaíochtaí a bhainistiú ar bhealach inbhuanaithe

source: The lenders that have signed up to the protocol have committed to work with MABS money advisers to help customers to address their debt problems and agree a sustainable plan of repayments
ga: Oibríonn na hinstitiúidí creidmheasa a shínigh an prótacal le comhairleoirí airgid MABS chun cabhrú le custaiméirí aghaidh a thabhairt ar fhadhbanna fiachais agus iad a bhainistiú

source: The protocol allows for write-off of some debt, at the lender’s discretion
ga: Ceadaítear sa phrótacal do dhíscríobh roinnt fiachais, faoi rogha an iasachtóra

source: It does not apply to mortgage debt
ga: Ní bhíonn feidhm leis d’fhiach morgáiste

source: You can read more about this protocol in these FAQs (pdf)
ga: Léigh tuilleadh sna ceisteanna coitianta seo (pdf)

source: Separately from this protocol, MABS can also help you to agree a sustainable repayment plan with your other creditors
ga: Ar leithligh ón bprótacal seo, is féidir le MABS cabhrú leat plean inbhuanaithe i leith aisíocaíochtaí a chomhaontú le creidiúnaithe eile freisin

source: Accessing personal insolvency options: All MABS services are registered as Approved Intermediaries with the Insolvency Service of Ireland (ISI) and can bring you through the process of getting a Debt Relief Notice if this is an appropriate solution for you
ga: Rochtain a fháil ar roghanna dócmhainneachta pearsanta: Bíonn gach seirbhís MABS cláraithe mar Idirghabhálaithe Ceadaithe le Seirbhís Dócmhainneachta na hÉireann (SDÉ) agus is féidir leo tú a thabhairt trí phróiseas Fhógra Faoisimh Fhiachais a fháil más réiteach iomchuí duitse é sin

source: MABS can also advise you on how to access the other personal insolvency options – see below
ga: Is féidir leis an MABS comhairle a thabhairt duit freisin faoin gcaoi chun rochtain a fháil ar roghanna dócmhainneachta pearsanta eile – féach thíos

source: Dealing with mortgage arrears: MABS has a Dedicated Mortgage Arrears service in over 20 locations
ga: Dul i ngleic le riaráistí morgáiste: Tá seirbhís shaintiomanta ag MABS do Riaráistí Morgáiste i níos mó ná 20 suíomh

source: It also operates a court mentor service, in collaboration with the Insolvency Service of Ireland (ISI), to assist debtors faced with court proceedings
ga: Oibríonn sé seirbhís mheantóra cúirte freisin, i gcomhar le Seirbhís Dócmhainneachta na hÉireann (SDÉ), chun cúnamh le féichiúnaithe a thagann os comhair imeachtaí cúirte

source: Read more about these services
ga: Léigh a thuilleadh faoi na seirbhísí úd

source: MABS is also centrally involved in a new aid and advice scheme for people in serious mortgage arrears, as part of Abhaile, the national Mortgage Arrears Resolution Service
ga: Bíonn MABS bainteach go lárnach freisin le scéim chabhrach agus chomhairle nua do dhaoine le riaráistí morgáiste tromchúiseacha, mar chuid de Abhaile, an tSeirbhís Náisiúnta um Réiteach na Riaráistí Morgáiste

source: This service was launched in October 2016
ga: Seoladh an tseirbhís úd i mí Dheireadh Fómhair 2016

source: Contacting MABS: The MABS Helpline 0761 07 2000 is open from 9am to 8pm, Monday to Friday
ga: Dul i dteagmháil le MABS: Tá Líne Chabhrach MABS 0761 07 2000 ar fáil Luan go hAoine idir 9rn agus 8in

source: You can also email helpline@mabs.ie or you can make an appointment to meet a money adviser in person in one of the nationwide network of MABS offices
ga: Is féidir ríomhphost a sheoladh chuig helpline@mabs.ie nó is féidir leat teagmháil a dhéanamh le d’oifig MABS áitiúil chun comhairle agus cúnamh a fháil ó chomhairleoir airgid

source: Three personal insolvency options have been introduced for people who cannot afford to pay their personal and mortgage debts
ga: Táthar tar éis trí rogha dócmhainneachta pearsanta a thabhairt isteach do dhaoine nach bhfuil ar a n-acmhainn a gcuid fiach pearsanta agus morgáiste a íoc

source: The system of bankruptcy has also been updated
ga: Táthar tar éis an córas féimheachta a nuashonrú freisin

source: The Insolvency Service of Ireland (ISI) administers all of these debt resolution processes
ga: Is í Seirbhís Dócmhainneachta na hÉireann (SDÉ) a riarann na próisis réitigh fhiachais sin go léir

source: It publishes extensive information on its website, isi.gov.ie
ga: Foilsíonn sí faisnéis fhairsing ar a láithreán gréasáin, isi.gov.ie

source: The ISI also has a debtor-focused website backontrack.ie, giving examples of how individuals have managed to resolve their problem debt, along with step-by-step guides on dealing with debt
ga: Tá láithreán gréasáin ag an SDÉ atá dírithe ar fhéichiúnaithe backontrack.ie, ina dtugtar samplaí den chaoi ar éirigh le daoine aonair chun a bhfiach fabhtach a réiteach, i dteannta le treoracha céimnithe chun dul i ngleic le fiachas

source: You can use the website to request a callback, or you can contact the ISI’s helpline 0761 06 4200, which is open from 9am to 6pm, Monday to Friday
ga: Is féidir leat úsáid a bhaint as an láithreán gréasáin chun athghlao a iarraidh, nó is féidir leat teagmháil a dhéanamh le líne chabhrach na SDÉ ag 0761 06 4200, a bhíonn ar oscailt idir 9r.n. agus 6i.n., Luan go hAoine

source: The ISI has also published a quick guide to debt solutions (pdf) and the “Back on Track” guide to problem debt (pdf)
ga: Tá an SDÉ tar éis quick guide to debt solutions (pdf) (mearthreoir do réitigh ar fhiachas agus “Back on Track” guide to problem debt (pdf) (Treoir “Teacht Aniar” i leith an fhiachais fhabhtaigh) a fhoilsiú freisin

source: What you can do yourself
ga: Conas fiacha a láimhseáil tú féin

source: If you are in mortgage arrears, or feel you are likely to be in mortgage arrears soon, the most important step you can take is to contact your lender immediately
ga: Má tá riaráistí morgáiste agat, nó go mbraitheann tú gur dócha go mbeidh riaráistí morgáiste agat go luath, is í an chéim is tábhachtaí ar féidir leat a ghlacadh ná chun teagmháil a dhéanamh le d’iasachtóir láithreach bonn

source: You can find out more in our overview of mortgage debt
ga: Is féidir leat teacht ar a thuilleadh inár bhforbhreathnú ar an bhfiach morgáiste

source: For other debts, it is also very important to let your creditors know that you are having difficulties
ga: Tá sé fíor-thabhachtach dul i dteagmháil le do chreidiúnaithe agus fios a chur orthu go bhfuil fadhbanna agat

source: Then you will be able to work with them to deal with the situation
ga: Ansin beidh tú in ann obair in éineacht leo chun dul i ngleic le do chuid fadhbanna

source: Otherwise the problems and the pressure from creditors will just get worse
ga: Seachas sin, rachadh na fadhbanna agus an brú ó do chreidiúnaithe i ndonas

source: Even if you have already sought help, you can use the MABS self-help tool to help you through the following steps:
ga: Fiú má tá cabhair á lorg agat cheana féin, is féidir treoir féin-chabhrach MABS a úsáid chun na céimeanna seo a leanúint:

source: Make a list of all your debts
ga: Déan amach liosta de d'fhiacha uile

source: Check that each debt is in your name
ga: Ceadaigh gur faoi d’ainm é gach fiach

source: Identify the debts needing immediate attention (for example, your mortgage arrears)
ga: Aithin na fiacha óna dteastaíonn aird láithreach (mar shampla, do riaráistí morgáiste)

source: Get in touch with the lenders immediately - preferably in writing
ga: Déan teagmháil leis na hiasachtóirí láithreach - b’fhearr í a chur i scríbhinn

source: There is a sample letter on the MABS website
ga: Tá litir shamplach ar láithreán gréasáin SBCA

source: List how much money is coming into your household each week (or month) and how much is going out
ga: Liostaigh cé mhéid airgid a thagann isteach gach seachtain (no gach mí) agus cé mhéid airgid a théann amach

source: You can get useful documents like a blank budget sheet and spending diary (pdf) from the MABS website or request them through the MABS helpline
ga: Is féidir leat cáipéisí úsáideacha agus bileog bhuiséid bhán spending diary (pdf)(dialann chaiteachais) a fháil ó láithreán gréasáin MABS féin nó iad a iarraidh trí líne chabhrach MABS

source: MABS also has a dedicated budgeting tool
ga: Tá uirlis bhuiséadaithe tool shaintiomanta ag MABS freisin

source: Deal with the debt
ga: Deileáil leis na fiacha

source: Write to the lender, making an offer of the amount you can afford to pay and explaining your financial situation
ga: Scríobh chuig an iasachtóir, tairg an méid airgid is féidir leat a íoc agus déan cur síos ar do staid airgeadais

source: The MABS website has a sample letter of offer and blank financial statements
ga: Tá litir shamplach ar láithreán MABS

source: Organise a method of paying the agreed amount
ga: Cuir córas i bhfeidhm chun an t-airgead a íoc

source: You can do this in various ways, such as direct debit, internet banking or a MABS Budget Account
ga: Is féidir leat é sin a dhéanamh ar bhealaí éagsúla, ar nós an dochair dhírigh, na baincéireachta idirlín nó Cuntais Bhuiséid MABS

source: There are different forms of debt, including mortgages, loans, overdrafts, credit cards and hire purchase agreements
ga: Tá cineálacha éagsúla fiachais ann, lena n-áirítear morgáistí, iasachtaí, ró-tharraingtí, cártaí creidmheasa agus comhaontuithe fruilcheannaigh

source: Some debts, for example, mortgages, are secured – this means that goods or property, usually your house, is used as security in case the debt is not paid
ga: Tá roinnt fiachais, mar shampla, morgáistí, 'urraithe' - ciallaíonn sé sin go n-úsáidtear earraí nó maoin, do theach de ghnáth, mar urrús sa chás nach n-íoctar an fiachas

source: Find out more about types of debt and debt terminology in our glossary of debt terms
ga: Faigh tuilleadh eolais faoi na cineálacha fiachais agus téarmaíocht a bhaineann le fiachas inár ngluais téarmaí a bhaineann le fiachas

source: Some debts have specific rules and practices in place in relation to how they are managed and collected
ga: Baineann rialacha agus nósanna imeachta ar leith le roinnt fiachas maidir leis an gcaoi a mbainistítear agus a mbailítear iad

source: These are mainly debts which are owed to the State or a State body
ga: Is fiachais iad seo den chuid is mó atá dlite don Stát nó do chomhlacht Stáit

source: In particular, taxes, social welfare overpayments, local authority rents and housing loans, utility bills and TV licences all have specific rules and procedures
ga: Tá rialacha agus nósanna imeachta ar leith ag cánacha, ró-íocaíochtaí leasa shóisialaigh, cíosanna údaráis áitiúla agus iasachtaí tithíochta, táillí dramhaíola, billí fóntais, ceadúnais teilifíse agus ceadúnais mhadra go háirithe

source: Find out more about the rules for specific debts
ga: Faigh tuilleadh eolais faoi na rialacha maidir le fiachais ar leith

source: There are general rules under consumer credit legislation in relation to collecting debts, including rules in relation to privacy, contact points and harassment and intimidation
ga: Tá rialacha ann faoi reachtaíocht chreidmheasa tomhaltóirí maidir le bailiú fiachas, lena n-áirítear rialacha maidir le príobháideachas, pointí teagmhála agus ciapadh agus imeaglú

source: There is a particular code of conduct for how lenders must engage with people in mortgage arrears or pre-arrears
ga: Is ann do chód iompair faoi leith don chaoi ina gcaitheann iasachtóirí dul i ngleic le daoine le riaráistí nó le réamhriaráistí morgáiste

source: If you do not engage with your lender, your lender will most likely initiate legal proceedings to recover the debt
ga: Mura ndéanann tú teagmháil le d'iasachtóir, tá gach cosúlacht ann go gcuirfidh sé tús le himeachtaí dlíthiúla chun an fiachas a aisghabháil

source: The case can be taken in the District Court, Circuit Court or High Court, depending on the amount of money involved
ga: Is féidir an cás a thógáil sa Chúirt Dúiche, sa Chúirt Chuarda nó san Ard-Chúirt, ag brath ar an méid airgid atá i gceist

source: Once your lender has a Court judgment setting out the debt, this judgment can be enforced in various ways, including, in extreme cases, through bankruptcy proceedings
ga: Nuair a dhéantar breithiúnas sa chúirt ina leagtar amach an fiachas, is féidir an breithiúnas seo a chur i bhfeidhm ar bhealaí éagsúla, lena n-áirítear imeachtaí féimheachta i gcásanna tromchúiseacha

source: Being in arrears on debt repayments can also have other consequences, for example, it can affect your credit rating and make it difficult to get credit in the future
ga: D’fhéadfadh go mbeadh iarmhairtí eile i gceist nuair atá tú i riaráiste ar aisíocaíochtaí fiachais chomh maith, mar shampla, d’fhéadfadh sé dul i bhfeidhm ar do ráta creidmheasa, rud a chiallódh go mbeadh sé deacair creidmheas a fháil sa todhchaí

source: When someone has died, there are detailed rules about how their debts must be dealt with
ga: Is ann do rialacha mionsonraithe faoin gcaoi ina gcaithfear lena bhfiacha nuair a fhaigheann duine éigin bás

source: You can read more about current and proposed developments on personal debt and mortgage arrears in our document on responses to mortgage arrears and personal debt
ga: Tá tuilleadh eolais faoi phleananna maidir le nósanna imeachta i leith fiachais inár gcáipéis Freagairtí maidir le riaráistí morgáiste agus fiachas pearsanta
